app/views/supplies/_form.html.erb

    <div class="col-lg-10">
      <%= f.collection_select(:car_id, Car.where("user_id = ?", current_user.id),
                                          :id, :placa, :prompt => true) %>
---
SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]