app/controllers/cars_controller.rb

  def create
    @car = Car.new(car_params)
    @car.user_id = current_user.id

    respond_to do |format|
      if @car.save
---
INSERT INTO "cars" ("placa", "modelo", "ano", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["placa", "prf3179"], ["modelo", "march"], ["ano", 2003], ["created_at", 2017-02-27 02:22:58 UTC], ["updated_at", 2017-02-27 02:22:58 UTC], ["user_id", 4]]