app/controllers/supplies_controller.rb

  def index
    @supplies = Supply.all
---
SELECT "supplies".* FROM "supplies"

  def query
    @supplies = Supply.all
---
SELECT "supplies".* FROM "supplies"

  def create
    @supply = Supply.new(supply_params)
    @supply.user_id = current_user.id

    respond_to do |format|
      if @supply.save
---
INSERT INTO "supplies" ("data", "posto", "combustivel", "created_at", "updated_at", "user_id", "car_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["data", Mon, 27 Feb 2017], ["posto", "ghfg"], ["combustivel", ""], ["created_at", 2017-02-27 03:26:36 UTC], ["updated_at", 2017-02-27 03:26:36 UTC], ["user_id", 4], ["car_id", 1]]

  def destroy
    @supply.destroy
---
DELETE FROM "supplies" WHERE "supplies"."id" = ?  [["id", 1]]

    def set_supply
      @supply = Supply.find(params[:id])
---
SELECT  "supplies".* FROM "supplies" WHERE "supplies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]